       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATOS-INDICE.
        
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUT-DATA-IND ASSIGN TO 'datos.txt'.
        
       DATA DIVISION.
       FILE SECTION.
       FD OUTPUT-DATA-IND
           RECORDING MODE IS F
           RECORD CONTAINS 52 CHARACTERS
           DATA RECORD IS FD-OUT-DATA-REC.
       01 FD-OUT-DATA-REC  PIC X(52).
        
       WORKING-STORAGE SECTION.
       01 NUM-RAND-DEC     PIC 9(01)V9(10).
       01 MULTIPLICATOR    PIC 999V99.
       01 NUM-RAND         PIC 99V99.
        
       01 WS-OUT-DATA-REC.
           02 FILLER1      PIC X(12) VALUE 'TEMPERATURA '.
           02 TEMPERATURE  PIC 99V99 VALUE ZEROS.
           02 FILLER2      PIC X(09) VALUE ' HUMEDAD '.
           02 HUMIDITY     PIC 99V99 VALUE ZEROS.
           02 FILLER3      PIC X(05) VALUE ' CO2 '.
           02 CO2          PIC 9(03) VALUE ZEROS.
           02 FILLER4      PIC X(08) VALUE ' INDICE '.
           02 INDEX-NUM    PIC 99V99 VALUE ZEROS.
        
       PROCEDURE DIVISION.
           PERFORM P002-WRITE-DATA 100 TIMES.
       STOP RUN.
        
       P001-GENERATE-RAMDOM.
           COMPUTE NUM-RAND-DEC = FUNCTION RANDOM
           MULTIPLY NUM-RAND-DEC BY MULTIPLICATOR GIVING NUM-RAND
       .
        
       P002-WRITE-DATA.
       OPEN OUTPUT OUTPUT-DATA-IND
           MOVE 10.00 TO MULTIPLICATOR
           PERFORM P001-GENERATE-RAMDOM
           MOVE NUM-RAND TO TEMPERATURE
           PERFORM P001-GENERATE-RAMDOM
           MOVE NUM-RAND TO HUMIDITY
           MOVE 100.00 TO MULTIPLICATOR
           PERFORM P001-GENERATE-RAMDOM
           MOVE NUM-RAND TO CO2
           MULTIPLY TEMPERATURE BY 0.4 GIVING TEMPERATURE
           MOVE WS-OUT-DATA-REC TO FD-OUT-DATA-REC
           WRITE FD-OUT-DATA-REC
       CLOSE OUTPUT-DATA-IND
       .
